Tekla Open API Reference for Tekla Structures 2025
ReferenceModelObject.GetReferenceModel Method
 Gets the reference model that the reference object belongs to.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReferenceModel GetReferenceModel()
Public Function GetReferenceModel As ReferenceModel
Return Value
Type: ReferenceModel
The reference model on success, null otherwise.
See Also
Reference
ReferenceModelObject Class
Tekla.Structures.Model Namespace